<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5eb1b8b7fdcf8c977c4e248f801b924bdbb794a646b24f8b2fe5ad87a7494dbb","plan_job_ref":"Job Run Terraform plan in staging #99 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12505136673","plan_out_hash":"4c4d65ff3291bba423577530e774ce972464bb3918f80d2fa4decc29a0bd530a","plan_hash":"98ad0b99677b82b6c953c10390cdb639371b2b85863a22a4af79c8b5d5684636","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 15 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.external.set-app-space-egress will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "set-app-space-egress" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "set_space_egress.sh",
+           "-t",
+           "-s",
+           "capoc-stage",
+           "-o",
+           "gsa-tts-devtools-prototyping",
        ]
+       result      = (known after apply)
+       working_dir = "."
    }

  # data.external.set-egress-space-egress will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "set-egress-space-egress" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "set_space_egress.sh",
+           "-p",
+           "-s",
+           "capoc-stage-egress",
+           "-o",
+           "gsa-tts-devtools-prototyping",
        ]
+       result      = (known after apply)
+       working_dir = "."
    }

  # cloudfoundry_app.app will be created
+   resource "cloudfoundry_app" "app" {
+       buildpacks                  = [
+           "ruby_buildpack",
        ]
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       environment                 = {
+           "RAILS_ENV"                = "staging"
+           "RAILS_LOG_TO_STDOUT"      = "true"
+           "RAILS_MASTER_KEY"         = (sensitive value)
+           "RAILS_SERVE_STATIC_FILES" = "true"
+           "no_proxy"                 = "apps.internal,s3-fips.us-gov-west-1.amazonaws.com"
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
+       name                        = "continuous_monitoring-staging"
+       org_name                    = "gsa-tts-devtools-prototyping"
+       path                        = "./dist/src.zip"
+       processes                   = [
+           {
+               command                     = "bundle exec rake cf:on_first_instance db:migrate && exec bundle exec rails s -b 0.0.0.0 -p $PORT -e $RAILS_ENV"
+               disk_quota                  = (known after apply)
+               health_check_type           = (known after apply)
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
+       readiness_health_check_type = (known after apply)
+       routes                      = [
+           {
+               protocol = (known after apply)
+               route    = "continuous_monitoring-staging.app.cloud.gov"
            },
        ]
+       service_bindings            = [
+           {
+               service_instance = "continuous_monitoring-rds-staging"
            },
+           {
+               service_instance = "egress-proxy-staging-credentials"
            },
        ]
+       source_code_hash            = "PHquVd5fjEj7l6E10k4c4/NNHSfAwD3zCfU2pI6rDbc="
+       space_name                  = "capoc-stage"
+       stack                       = (known after apply)
+       strategy                    = "blue-green"
+       updated_at                  = (known after apply)
    }

  # cloudfoundry_network_policy.egress_routing will be created
+   resource "cloudfoundry_network_policy" "egress_routing" {
+       id = (known after apply)

+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # cloudfoundry_service_instance.egress_proxy_credentials will be created
+   resource "cloudfoundry_service_instance" "egress_proxy_credentials" {
+       created_at        = (known after apply)
+       credentials       = (sensitive value)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "egress-proxy-staging-credentials"
+       space             = (known after apply)
+       type              = "user-provided"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

  # module.app_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh  = true
+       created_at = (known after apply)
+       id         = (known after apply)
+       name       = "capoc-stage"
+       org        = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
+       quota      = (known after apply)
+       updated_at = (known after apply)
    }

  # module.app_space.cloudfoundry_space_role.developers["671a08be-3fef-449d-8ca0-03e28f869d70"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = (known after apply)
+       username   = "671a08be-3fef-449d-8ca0-03e28f869d70"
    }

  # module.app_space.cloudfoundry_space_role.developers["ryan.ahearn@gsa.gov"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = (known after apply)
+       username   = "ryan.ahearn@gsa.gov"
    }

  # module.app_space.cloudfoundry_space_role.managers["671a08be-3fef-449d-8ca0-03e28f869d70"] will be created
+   resource "cloudfoundry_space_role" "managers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_manager"
+       updated_at = (known after apply)
+       user       = (known after apply)
+       username   = "671a08be-3fef-449d-8ca0-03e28f869d70"
    }

  # module.database.data.cloudfoundry_service_plans.rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "rds" {
+       name                  = "micro-psql"
+       service_offering_name = "aws-rds"
+       service_plans         = (known after apply)
    }

  # module.database.cloudfoundry_service_instance.rds will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       created_at        = (known after apply)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "continuous_monitoring-rds-staging"
+       service_plan      = (known after apply)
+       space             = (known after apply)
+       tags              = [
+           "terraform-cloudgov-managed",
        ]
+       type              = "managed"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

  # module.egress_proxy.data.external.proxyzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "proxyzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-proxy.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy"
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be created
+   resource "cloudfoundry_app" "egress_app" {
+       buildpacks                  = [
+           "binary_buildpack",
        ]
+       command                     = "./caddy run --config Caddyfile"
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       environment                 = {
+           "PROXY_ALLOW"    = <<-EOT
                raw.githubusercontent.com
            EOT
+           "PROXY_DENY"     = ""
+           "PROXY_PASSWORD" = (sensitive value)
+           "PROXY_PORTS"    = "443"
+           "PROXY_USERNAME" = (known after apply)
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = 2
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = "64M"
+       name                        = "egress-proxy-staging"
+       org_name                    = "gsa-tts-devtools-prototyping"
+       path                        = (known after apply)
+       readiness_health_check_type = (known after apply)
+       routes                      = [
+           {
+               protocol = (known after apply)
+               route    = "ts-devtools-prototyping-capoc-stage-egress-egress-proxy-staging.apps.internal"
            },
        ]
+       source_code_hash            = (known after apply)
+       space_name                  = "capoc-stage-egress"
+       stack                       = (known after apply)
+       strategy                    = "rolling"
+       updated_at                  = (known after apply)
    }

  # module.egress_proxy.random_password.password will be created
+   resource "random_password" "password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.egress_proxy.random_uuid.username will be created
+   resource "random_uuid" "username" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.egress_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh  = true
+       created_at = (known after apply)
+       id         = (known after apply)
+       name       = "capoc-stage-egress"
+       org        = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
+       quota      = (known after apply)
+       updated_at = (known after apply)
    }

  # module.egress_space.cloudfoundry_space_role.developers["671a08be-3fef-449d-8ca0-03e28f869d70"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = (known after apply)
+       username   = "671a08be-3fef-449d-8ca0-03e28f869d70"
    }

  # module.egress_space.cloudfoundry_space_role.developers["ryan.ahearn@gsa.gov"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = (known after apply)
+       username   = "ryan.ahearn@gsa.gov"
    }

  # module.egress_space.cloudfoundry_space_role.managers["671a08be-3fef-449d-8ca0-03e28f869d70"] will be created
+   resource "cloudfoundry_space_role" "managers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_manager"
+       updated_at = (known after apply)
+       user       = (known after apply)
+       username   = "671a08be-3fef-449d-8ca0-03e28f869d70"
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #99](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12505136673)